a-h.templ
ahmadalli.vscode-nginx-conf
astro-build.astro-vscode
asvetliakov.vscode-neovim
batisteo.vscode-django
bennycode.sort-everything
benspaulding.procfile
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bmalehorn.vscode-fish
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bradlc.vscode-tailwindcss
byi8220.indented-block-highlighting
chaojie.better-mako
charliermarsh.ruff
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
ckolkman.vscode-postgres
csstools.postcss
ctc.vscode-tree-extension
d-koppenhagen.file-tree-to-text-generator
dariofuzinato.vue-peek
dbaeumer.vscode-eslint
docker.docker
dustypomerleau.rust-syntax
ecmel.vscode-html-css
editorconfig.editorconfig
esbenp.prettier-vscode
extr0py.vscode-relative-line-numbers
firefox-devtools.vscode-firefox-debug
github.copilot-chat
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
google.wireit
graphql.vscode-graphql
graphql.vscode-graphql-syntax
gruntfuggly.activitusbar
gruntfuggly.todo-tree
hashhar.gitattributes
hashicorp.hcl
hbenl.vscode-test-explorer
hossaini.quasar-intellisense
jakebecker.elixir-ls
jakestanger.corn
jannisx11.batch-rename-extension
jasonnutter.vscode-codeowners
jdinhlife.gruvbox
jeff-hykin.better-shellscript-syntax
jock.svg
johnnymorganz.luau-lsp
johnsoncodehk.vscode-tsconfig-helper
lextudio.restructuredtext
mads-hartmann.bash-ide-vscode
malmaud.tmux
matangover.mypy
me-dutour-mathieu.vscode-github-actions
mechatroner.rainbow-csv
meronz.manpages
mgmcdermott.vscode-language-babel
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dynamics-smb.al
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.debugpy
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.makefile-tools
ms-vscode.remote-repositories
ms-vscode.test-adapter-converter
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
naumovs.color-highlight
navernoedenis.gruvbox-material-icons
njpwerner.autodocstring
orta.vscode-jest
pbkit.vscode-pbkit
pgourlain.erlang
phoenixframework.phoenix
pranaygp.vscode-css-peek
prisma.prisma
pucelle.vscode-css-navigation
quentinguidee.gitignore-ultimate
redhat.ansible
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
rogalmic.bash-debug
rust-lang.rust-analyzer
saeris.markdown-github-alerts
samuelcolvin.jinjahtml
searking.preview-vscode
sqlfluff.vscode-sqlfluff
streetsidesoftware.code-spell-checker
stxr.iconfont-preview
stylelint.vscode-stylelint
subframe7536.custom-ui-style
sumneko.lua
svelte.svelte-vscode
syler.sass-indented
tamasfe.even-better-toml
timonwong.shellcheck
tomoki1207.pdf
trond-snekvik.simple-rst
unifiedjs.vscode-mdx
usernamehw.errorlens
valentin.beamdasm
vercel.turbo-vsc
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-test
vscjava.vscode-maven
vstirbu.vscode-mermaid-preview
vue.volar
vunguyentuan.vscode-postcss
wayou.vscode-todo-highlight
webben.browserslist
xyz.local-history
yoavbls.pretty-ts-errors
zainchen.json
ziglang.vscode-zig
zignd.html-css-class-completion
