ahmadalli.vscode-nginx-conf
antfu.iconify
astro-build.astro-vscode
asvetliakov.vscode-neovim
benspaulding.procfile
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
bmalehorn.vscode-fish
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bradlc.vscode-tailwindcss
charliermarsh.ruff
christian-kohler.path-intellisense
codezombiech.gitignore
csstools.postcss
darian-benam.vscode-robots-dot-txt-support
dbaeumer.vscode-eslint
dustypomerleau.rust-syntax
editorconfig.editorconfig
esbenp.prettier-vscode
github.vscode-github-actions
golang.go
gruntfuggly.todo-tree
hashhar.gitattributes
jacobpfeifer.pfeifer-hurl
jakebecker.elixir-ls
jannisx11.batch-rename-extension
jdinhlife.gruvbox
jock.svg
johnnymorganz.stylua
jonathanharty.gruvbox-material-icon-theme
kejun.markdown-alert
lokalise.i18n-ally
mads-hartmann.bash-ide-vscode
malmaud.tmux
matangover.mypy
mattn.lisp
mechatroner.rainbow-csv
ms-ossdata.vscode-pgsql
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.makefile-tools
nuxt.mdc
odiriuss.rust-macro-expand
ohziinteractivestudio.ohzi-vscode-glb-viewer
orta.vscode-jest
pgourlain.erlang
phoenixframework.phoenix
pucelle.vscode-css-navigation
qufiwefefwoyn.inline-sql-syntax
redhat.vscode-xml
redhat.vscode-yaml
remcohaszing.schemastore
richie5um2.vscode-sort-json
rust-lang.rust-analyzer
sammcleod.ghostty-config-syntax
streetsidesoftware.code-spell-checker
subframe7536.custom-ui-style
sumneko.lua
svelte.svelte-vscode
tamasfe.even-better-toml
tangzx.emmylua
timonwong.shellcheck
tomoki1207.pdf
unifiedjs.vscode-mdx
usernamehw.errorlens
vstirbu.vscode-mermaid-preview
vue.volar
wayou.vscode-todo-highlight
webben.browserslist
xadillax.viml
yoavbls.pretty-ts-errors
