ahmadalli.vscode-nginx-conf
astro-build.astro-vscode
asvetliakov.vscode-neovim
batisteo.vscode-django
bennycode.sort-everything
bierner.markdown-checkbox
bierner.markdown-preview-github-styles
bmalehorn.vscode-fish
bradlc.vscode-tailwindcss
byi8220.indented-block-highlighting
charliermarsh.ruff
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
csstools.postcss
dariofuzinato.vue-peek
dbaeumer.vscode-eslint
docker.docker
donjayamanne.githistory
ecmel.vscode-html-css
editorconfig.editorconfig
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
github.copilot
github.copilot-chat
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
gruntfuggly.activitusbar
gruntfuggly.todo-tree
hashicorp.hcl
hossaini.quasar-intellisense
jakebecker.elixir-ls
jannisx11.batch-rename-extension
jasonnutter.vscode-codeowners
jdinhlife.gruvbox
jeff-hykin.better-shellscript-syntax
jock.svg
johnsoncodehk.vscode-tsconfig-helper
mads-hartmann.bash-ide-vscode
malmaud.tmux
matangover.mypy
me-dutour-mathieu.vscode-github-actions
mechatroner.rainbow-csv
meronz.manpages
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-ossdata.vscode-pgsql
ms-python.debugpy
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.makefile-tools
ms-vscode.remote-repositories
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
naumovs.color-highlight
navernoedenis.gruvbox-material-icons
njpwerner.autodocstring
orta.vscode-jest
pbkit.vscode-pbkit
pgourlain.erlang
phoenixframework.phoenix
pkief.material-icon-theme
pranaygp.vscode-css-peek
prisma.prisma
pucelle.vscode-css-navigation
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
rogalmic.bash-debug
rpinski.shebang-snippets
rust-lang.rust-analyzer
samuelcolvin.jinjahtml
stylelint.vscode-stylelint
subframe7536.custom-ui-style
sumneko.lua
syler.sass-indented
tamasfe.even-better-toml
timonwong.shellcheck
tomoki1207.pdf
twxs.cmake
unifiedjs.vscode-mdx
usernamehw.errorlens
valentin.beamdasm
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-test
vscjava.vscode-maven
vue.volar
vunguyentuan.vscode-postcss
wayou.vscode-todo-highlight
webben.browserslist
yoavbls.pretty-ts-errors
zainchen.json
ziglang.vscode-zig
zignd.html-css-class-completion
