# dependencies:
# - elixir:
#   - unzip
# - erlang:
#   - autoconf
#   - fop
#   - libxslt
#   - openssl@3
#   - unixodbc
#   - wxwidgets
# - golang:
#   - coreutils
# - java:
#   - bash
#   - coreutils
#   - curl
#   - jq
#   - unzip
# - lua:
#   - readline
# - nodejs:
#   - icu4c
#   - gnupg
# - php:
#   - bison
#   - gd
#   - gmp
#   - imagemagick
#   - libiconv
#   - libsodium
#   - libzip
#   - openssl@3
#   - re2c
# - python:
#   - bzip2
#   - curl
#   - libxml2
#   - libxmlsec1
#   - llvm
#   - make
#   - ncurses
#   - readline
#   - sqlite
#   - tcl-tk
#   - wget
#   - xz
#   - zlib
brew "asdf"

# dependants:
# - neovim:
#   - grug-far
brew "ast-grep"

# dependants:
# - asdf:
#   - erlang
brew "autoconf"

# dependants:
# - asdf:
#   - java
# - tmux
# - tmux:
#   - continuum
#   - tpm
brew "bash"

# dependants:
# - yazi
brew "bat"

# dependants:
# - asdf:
#   - php
brew "bison"

# dependants:
# - asdf:
#   - python
brew "bzip2"

brew "cloc"

# dependants:
# - lima
brew "containerd"

# dependants:
# - <system>
# - asdf:
#   - golang
#   - java
brew "coreutils"

# dependants:
# - <system>
# - asdf:
#   - java
#   - python
# - neovim:
#   - mason
#   - treesitter
brew "curl"

# dependants:
# - git
brew "diff-so-fancy"

cask "dockdoor"

brew "docker"

brew "emacs"

# dependants:
# - <system>
# - neovim:
#   - telescope
# - yazi
brew "fd"

brew "FelixKratz/formulae/borders"

# dependants:
# - <system>
# - yazi
brew "ffmpeg"

# dependants:
# - <system>
# dependencies:
# - functions:
#   - nvim_reload_theme:
#     - neovim-remote
# - starship
brew "fish"

cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

# dependants:
# - asdf:
#   - erlang
brew "fop"

brew "forgit"

# dependants:
# - tmux:
#   - fuzzback
# - yazi
brew "fzf"

# dependants:
# - <system>
# - neovim:
#   - treesitter
brew "gcc"

# dependants:
# - asdf:
#   - php
brew "gd"

# dependencies: tmux
cask "ghostty"

# dependants:
# - <system>
# - asdf
# - neovim:
#   - mason
# - tmux:
#   - tpm
# dependencies:
# - diff-so-fancy
# - git-delta
brew "git"

# dependants:
# - git
# - neovim:
#   - actions-preview
brew "git-delta"

# dependants:
# - <system>
# - asdf:
#   - php
brew "gmp"

# - dependants:
# - <system>
#   - neovim:
#     - mason
#     - treesitter
brew "gnu-tar"

# dependants:
# - <system>
# - asdf:
#   - nodejs
brew "gnupg"

cask "google-chrome"

# dependants:
# - neovim:
#   - mason
brew "gzip"

brew "hf"

brew "htop"

brew "hurl"

# dependants:
# - asdf:
#   - nodejs
brew "icu4c"

# dependants:
# - <system>
# - asdf:
#   - php
# - yazi
brew "imagemagick"

cask "inkscape"

cask "jan"

# dependants:
# - <system>
# - asdf:
#   - java
# - nikitabobko/tap/aerospace:
#   - scripts:
#     - layout_floating_centered.sh
# - yazi
brew "jq"

cask "karabiner-elements"

cask "keycastr"

# dependencies:
# - tmux
cask "kitty"

cask "knockknock"

# dependants:
# - asdf:
#   - python
brew "libffi"

# dependants:
# - asdf:
#   - php
brew "libiconv"

cask "libreoffice"

# dependants:
# - asdf:
#   - php
brew "libsodium"

# dependants:
# - asdf:
#   - python
brew "libxml2"

# dependants:
# - asdf:
#   - python
brew "libxmlsec1"

# dependants:
# - tmux
brew "libsixel"

# dependants:
# - asdf:
#   - erlang
brew "libxslt"

# dependants:
# - asdf:
#   - php
brew "libzip"

# dependencies:
# - containerd
# - qemu
brew "lima"

cask "linearmouse"

# dependants:
# - <system>
# - asdf:
#   - python
brew "llvm"

cask "lulu"

# dependants:
# - <system>
# - asdf:
#   - python
brew "make"

brew "mas"

# dependencies:
# - nss
brew "mkcert"

# dependants:
# - <system>
brew "mlx"

# dependants:
# - <system>
brew "mlx-lm"

# dependants:
# - <system>
# - asdf:
#   - python
brew "ncurses"

# dependencies:
# - ripgrep
# - actions-preview:
#   - git-delta
# - mason:
#   - curl
#   - git
#   - gnu-tar
#   - gzip
#   - sevenzip
#   - unzip
# - grug-far:
#   - ast-grep
#   - ripgrep
# - telescope:
#   - fd
# - treesitter:
#   - gcc
#   - tree-sitter
#   - tree-sitter-cli
brew "neovim", args: ["HEAD"]

# dependants:
# - fish:
#   - functions:
#     - nvim_reload_theme
brew "neovim-remote"

brew "nginx"

# dependencies:
# - scripts:
#   - layout_floating_centered.sh:
#     - jq
cask "nikitabobko/tap/aerospace"

# dependants:
# - mkcert
brew "nss"

brew "ollama"

cask "open-webui"

# dependants:
# - asdf:
#   - erlang
#   - php
brew "openssl@3"

# dependencies:
# - tmux
brew "overmind"

cask "oversight"

brew "pandoc"

cask "pgadmin4"

brew "pinentry-mac"

# dependants:
# - <system>
# - asdf:
#   - php
# - wxwidgets
brew "pkgconf"

brew "podman"
brew "podman-compose"
cask "podman-desktop"

# dependants:
# - yazi
brew "poppler"

brew "postgresql"

# dependants:
# - lima
brew "qemu"

# dependants:
# - asdf:
#   - php
brew "re2c"

# dependants:
# - asdf:
#   - lua
#   - python
brew "readline"

# dependants:
# - yazi
brew "resvg"

# dependants:
# - neovim
# - neovim:
#   - grug-far
# - yazi
brew "ripgrep"

# dependants:
# - neovim:
#   - mason
# - yazi
brew "sevenzip"

mas "Shazam", id: 897_118_787

# dependants:
# - visual-studio-code
brew "shellcheck"

brew "skhd-zig"

cask "spotify"

# dependants:
# - <system>
# - asdf:
#   - python
brew "sqlite"

# dependants:
# - fish
brew "starship"

mas "System Color Picker", id: 1_545_870_783

# dependants:
# - asdf:
#   - python
brew "tcl-tk"

cask "telegram-desktop"

brew "timg"

# dependants:
# - ghostty
# - kitty
# - overmind
# dependencies:
# - bash
# - continuum:
#   - bash
# - fuzzback:
#   - fzf
# - libsixel
# - tpm:
#   - bash
#   - git
# - utf8proc
brew "tmux"

cask "tor-browser"

brew "tree"

# dependants:
# - neovim:
#   - treesitter
brew "tree-sitter"

# dependants:
# - neovim:
#   - tree-sitter-cli
brew "tree-sitter-cli"

# dependants:
# - asdf:
#   - erlang
brew "unixodbc"

# dependants:
# - <system>:
# - asdf:
#   - elixir
#   - java
# - neovim:
#   - mason
brew "unzip"

# dependants:
# - tmux
brew "utf8proc"

# dependencies:
# - shellcheck
cask "visual-studio-code"

cask "vlc"

brew "watch"

brew "watchexec"

brew "weasyprint"

# dependants:
# - <system>:
# - asdf:
#   - python
# - neovim:
#   - mason
brew "wget"

cask "whatsapp"

# dependencies:
# - pkgconf
brew "wxwidgets"

# mas "Xcode", id: 497_799_835

# dependants:
# - asdf:
#   - python
brew "xz"

# dependencies:
# - bat
# - fd
# - ffmpeg
# - fzf
# - imagemagick
# - jq
# - poppler
# - resvg
# - ripgrep
# - sevenzip
brew "yazi"

cask "zen"

# dependants:
# - <system>:
# - asdf:
#   - python
brew "zlib"
