tap "FelixKratz/formulae"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "nats-io/nats-tools"

brew "asdf"
brew "ast-grep"
brew "autoconf"
brew "bat"
brew "bison"
brew "brotli"
brew "cloc"
brew "coredns"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "dive"
brew "docker"
brew "etcd"
brew "fastfetch"
brew "fd"
brew "FelixKratz/formulae/borders"
brew "FelixKratz/formulae/sketchybar"
brew "ffmpeg"
brew "fish"
brew "flex"
brew "fop"
brew "foreman"
brew "forgit"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gettext"
brew "gdb"
brew "gh"
brew "git-delta"
brew "gmp"
brew "gnupg"
brew "htop"
brew "icu4c"
brew "imagemagick"
brew "jq"
brew "jstkdng/programs/ueberzugpp"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "libevent"
brew "libheif"
brew "libiconv"
brew "libiodbc"
brew "libsixel"
brew "libsodium"
brew "libxslt"
brew "lima"
brew "mas"
brew "mkcert"
brew "nats-io/nats-tools/nats"
brew "nats-server"
brew "ncurses"
brew "neovim"
brew "neovim-remote"
brew "netcat"
brew "nginx"
brew "ollama"
brew "openssl@3"
brew "pgbouncer"
brew "pinentry-mac"
brew "pkgconf"
brew "plantuml"
brew "podman"
brew "podman-compose"
brew "poppler"
brew "postgresql@18"
brew "qemu"
brew "re2c"
brew "reattach-to-user-namespace"
brew "resvg"
brew "ripgrep"
brew "samply"
brew "sevenzip"
brew "shellcheck"
brew "sqlfluff"
brew "sqlite"
brew "starship"
brew "tcl-tk"
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
brew "tmuxp"
brew "tree"
brew "tree-sitter"
brew "unixodbc"
brew "universal-ctags"
brew "unzip"
brew "upx"
brew "valkey"
brew "vegeta"
brew "vim"
brew "watchman"
brew "wget"
brew "wxwidgets"
brew "xz"
brew "yazi"
brew "zstd"

cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

cask "alacritty"
cask "alt-tab"
cask "anydesk"
cask "bruno"
cask "firefox"
cask "firefox@developer-edition"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "hoppscotch"
cask "inkscape"
cask "karabiner-elements"
cask "keycastr"
cask "knockknock"
cask "libreoffice"
cask "linearmouse"
cask "lulu"
cask "multipass"
cask "oversight"
cask "pgadmin4"
cask "podman-desktop"
cask "spotify"
cask "telegram-desktop"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zen"

mas "Shazam", id: 897_118_787
# mas "System Color Picker", id: 1_545_870_783
# mas "Xcode", id: 497_799_835

