tap "FelixKratz/formulae"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "jstkdng/programs"
tap "koekeishiya/formulae"

brew "asdf"
brew "ast-grep"
brew "autoconf"
brew "bat"
brew "brotli"
brew "coreutils"
brew "curl"
cask "docker"
brew "dive"
brew "fastfetch"
brew "fd"
brew "FelixKratz/formulae/borders"
brew "FelixKratz/formulae/sketchybar"
brew "ffmpeg"
brew "fish"
brew "flex"
brew "fop"
brew "fzf"
brew "gcc"
brew "gettext"
brew "gdb"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "jstkdng/programs/ueberzugpp"
brew "jupyterlab"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "libevent"
brew "libiodbc"
brew "libsixel"
brew "libxslt"
brew "lima"
brew "mas"
brew "mkcert"
brew "ncurses"
brew "neovim"
brew "neovim-remote"
brew "netcat"
brew "nginx"
brew "ollama"
brew "openssl@1.1"
brew "openssl@3"
brew "pinentry-mac"
brew "podman"
brew "podman-compose"
brew "poppler"
brew "qemu"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "sevenzip"
brew "shellcheck"
brew "sqlite"
brew "starship"
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
brew "tmuxp"
brew "tree"
brew "tree-sitter"
brew "universal-ctags"
brew "upx"
brew "vim"
brew "watchman"
brew "wget"
brew "wxwidgets"
brew "xz"
brew "yazi"

cask "homebrew/cask-fonts/font-jetbrains-mono"
cask "homebrew/cask-fonts/font-jetbrains-mono-nerd-font"

cask "alacritty"
cask "alt-tab"
cask "anydesk"
cask "bruno"
cask "firefox"
cask "firefox@developer-edition"
cask "gimp"
cask "github"
cask "google-chrome"
cask "hoppscotch"
cask "inkscape"
cask "karabiner-elements"
cask "keycastr"
cask "libreoffice"
cask "linearmouse"
cask "livebook"
cask "opera"
cask "pgadmin4"
cask "podman-desktop"
cask "spotify"
mas "Shazam", id: 897_118_787
mas "System Color Picker", id: 1_545_870_783
cask "telegram-desktop"
cask "tor-browser"
cask "visual-studio-code"
cask "whatsapp"
cask "zen-browser"
